misha-z1nchuk/dronebench-ate/firmware/app/stm32/src/app_stm32.c
/*
 * DroneBench ATE — STM32 application layer.
 *
 * Everything below the CLI table is the same core the ESP32 build runs and
 * the same core `make test` runs on the host. Nothing in firmware/core/ was
 * changed to make this file work; if that ever stops being true, the
 * architecture has failed and the commit that broke it should say so.
 */
#include "app_stm32.h"

#include <inttypes.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "dronebench/calibration.h"
#include "dronebench/cli.h"
#include "dronebench/current_sensor.h"
#include "dronebench/metrics.h"
#include "dronebench/platform.h"
#include "dronebench/sampler.h"
#include "dronebench/session.h"
#include "dronebench/simulator.h"
#include "dronebench/telemetry.h"
#include "platform_stm32.h"
#include "stm32f4xx_hal.h"

extern UART_HandleTypeDef huart2;

#define FW_VERSION "0.1.0"

/*
 * Same rate as the ESP32 build, so a session logged from either board is the
 * same measurement and the host tools cannot tell them apart.
 *
 * It fits, but only because the port is fast. One sample line is
 * "S,<us>,4.123,1.234,1.240\n" — about 32 bytes, and at 460800 baud that is
 * 32 * 10 / 460800 = 0.7 ms of blocking transmit inside a 2 ms period. A
 * third of the budget, with the ADC burst on top.
 *
 * At 115200 it would not fit: 2.8 ms of transmit into a 2 ms period is a
 * telemetry stream that falls permanently behind its own clock, and the
 * symptom would be a growing timestamp gap rather than an error. 460800 is
 * also what tools/serial_logger/logger.py defaults to, so USART2 has to be
 * set to it in CubeMX for `make log` to connect at all.
 */
#define SAMPLE_RATE_HZ 500
#define SAMPLE_PERIOD_US (1000000u / SAMPLE_RATE_HZ)

/* Headroom of a few periods, not one: a sample later than this is still
   accepted, but counted, because charge integrated across a gap is an
   estimate. */
#define MAX_GAP_US (10u * 1000u)

/* Largest thing written in one go is a summary line; CLI replies are bounded
   by CLI_LINE_MAX. */
#define OUT_BUF 192

/* An `adc` burst long enough to see the noise, short enough not to stall the
   console for a noticeable time. */
#define ADC_MAX_READS 1024

static cli_t     s_cli;
static session_t s_session;
static sampler_t s_sampler;
static metrics_t s_metrics;

/* When the next sample is due, in the platform clock. Advanced by a fixed
   period rather than measured from now, so the transmit time of one line does
   not push the next sample later and accumulate into a drifting rate. */
static uint64_t s_next_sample_us;
static bool     s_streaming;

/* Longest a single sample took, from reading the clock to the end of its
   transmit. The period budget in platform_stm32.c is arithmetic with an
   estimate in it; this is the measurement that settles it. Above 2000 the
   stream cannot keep 500 Hz and `gaps` will say so too. */
static uint32_t s_worst_us;

/* Day 12 points collected by `cal add`, not yet fitted. */
static calibration_point_t s_cal_points[CALIBRATION_MAX_POINTS];
static uint32_t            s_cal_count;

/* ------------------------------------------------------------------------ */
/* Console                                                                  */
/* ------------------------------------------------------------------------ */

static void out(const char *text) { platform_uart_write(text, strlen(text)); }

static void cli_out(void *ctx, const char *text)
{
    (void)ctx;
    out(text);
}

/*
 * Non-blocking receive.
 *
 * Reads the data register directly rather than going through
 * HAL_UART_Receive(). HAL's blocking receive owns huart2.RxState for the
 * duration of the call, and a zero timeout still walks the state machine —
 * the result is a console that fights the transmit path for the handle. The
 * register is simpler and cannot deadlock against anything.
 *
 * The overrun flag has to be cleared explicitly. On the F4 an overrun stops
 * RXNE from ever being set again, so a single burst of pasted input that
 * arrives while a telemetry line is transmitting would silently kill the
 * console for the rest of the session — the exact class of failure this
 * project keeps finding: no error, just a thing that quietly stops working.
 */
static void console_poll(void)
{
    unsigned guard = 64; /* bound the work done per poll */

    while (guard-- > 0u) {
        uint32_t sr = huart2.Instance->SR;

        if ((sr & USART_SR_ORE) != 0u) {
            (void)huart2.Instance->DR; /* reading SR then DR clears ORE */
            continue;
        }
        if ((sr & USART_SR_RXNE) == 0u) {
            return;
        }
        cli_feed_char(&s_cli, (char)(huart2.Instance->DR & 0xFFu));
    }
}

/* ------------------------------------------------------------------------ */
/* Banner                                                                   */
/* ------------------------------------------------------------------------ */

/*
 * Why the reset cause is in the banner.
 *
 * The ESP32 build printed it too, and on 2026-08-28 that line was the whole
 * diagnosis: "brownout" said the supply had collapsed, not that the firmware
 * had crashed. On the STM32 the same information sits in RCC->CSR and is
 * sticky across resets, so it must be read and then cleared — an uncleared
 * flag makes every later reset look like the first one.
 */
static const char *reset_reason(void)
{
    if (__HAL_RCC_GET_FLAG(RCC_FLAG_LPWRRST)) return "low-power";
    if (__HAL_RCC_GET_FLAG(RCC_FLAG_WWDGRST)) return "window watchdog";
    if (__HAL_RCC_GET_FLAG(RCC_FLAG_IWDGRST)) return "independent watchdog";
    if (__HAL_RCC_GET_FLAG(RCC_FLAG_SFTRST))  return "software reset";
    if (__HAL_RCC_GET_FLAG(RCC_FLAG_BORRST))  return "brownout";
    if (__HAL_RCC_GET_FLAG(RCC_FLAG_PORRST))  return "power-on";
    if (__HAL_RCC_GET_FLAG(RCC_FLAG_PINRST))  return "reset pin";
    return "unknown";
}

static void print_banner(void)
{
    char  buf[OUT_BUF];
    float vdda = platform_stm32_vdda_mv();

    out("\n=================================\n");
    out(" DroneBench ATE\n");
    out("=================================\n");

    snprintf(buf, sizeof buf, " firmware     %s\n", FW_VERSION);
    out(buf);
    snprintf(buf, sizeof buf, " built        %s %s\n", __DATE__, __TIME__);
    out(buf);
    snprintf(buf, sizeof buf, " chip         STM32F446RE\n");
    out(buf);
    snprintf(buf, sizeof buf, " sysclk       %" PRIu32 " Hz\n", HAL_RCC_GetSysClockFreq());
    out(buf);

