misha-z1nchuk/dronebench-ate/firmware/app/stm32/src/app_stm32.c
    /* Not "3300". If the reference could not be established the bench says so
       rather than reporting a nominal number that reads exactly as plausible
       as a measured one. */
    if (vdda > 0.0f) {
        snprintf(buf, sizeof buf, " vdda         %.1f mV (from VREFINT)\n", (double)vdda);
    } else {
        snprintf(buf, sizeof buf, " vdda         unknown - ADC refuses\n");
    }
    out(buf);

    snprintf(buf, sizeof buf, " reset reason %s\n", reset_reason());
    out(buf);
    __HAL_RCC_CLEAR_RESET_FLAGS();

    out("=================================\n\n");
}

/* ------------------------------------------------------------------------ */
/* Commands                                                                 */
/*                                                                          */
/* Replies are machine-readable on purpose: in phase 3 the Python runner      */
/* sends these same commands and has to tell success from failure            */
/* programmatically, not by reading prose.                                   */
/* ------------------------------------------------------------------------ */

static void cmd_help(cli_t *cli, int argc, char **argv)
{
    (void)argc;
    (void)argv;
    cli_print_help(cli);
}

static void cmd_version(cli_t *cli, int argc, char **argv)
{
    char buf[OUT_BUF];

    (void)argc;
    (void)argv;
    snprintf(buf, sizeof buf, "OK,version,fw=%s,built=%s %s,target=stm32f446re\n",
             FW_VERSION, __DATE__, __TIME__);
    cli_write(cli, buf);
}

static void cmd_status(cli_t *cli, int argc, char **argv)
{
    char buf[OUT_BUF];

    (void)argc;
    (void)argv;
    snprintf(buf, sizeof buf,
             "OK,status,state=%s,uptime_s=%" PRIu32 ",accepted=%" PRIu32
             ",failed=%" PRIu32 ",gaps=%" PRIu32 ",worst_us=%" PRIu32 "\n",
             session_state_name(&s_session),
             /*
              * Deliberately narrowed to 32 bits. newlib-nano drops %llu
              * unless the image is linked with -u _printf_long_long, and it
              * drops it silently: the board printed "uptime_s=lu" for a week
              * before anyone ran it on hardware. Seconds overflow uint32_t
              * after 136 years, so the 64-bit formatter buys nothing here.
              */
             (uint32_t)(platform_time_us() / 1000000u),
             s_sampler.accepted, s_sampler.sensor_failures, s_sampler.gaps,
             s_worst_us);
    cli_write(cli, buf);
}

static void cmd_vdda(cli_t *cli, int argc, char **argv)
{
    char  buf[OUT_BUF];
    float vdda = platform_stm32_vdda_mv();

    (void)argc;
    (void)argv;

    /*
     * Exists to be compared against a multimeter on the 3V3 pin. Two
     * independent instruments on one rail, the same cross-check that caught
     * the bad probe contact on day 11. If they disagree by more than a few
     * millivolts, one is wrong, and the answer is to find out which before
     * trusting either.
     */
    if (vdda <= 0.0f) {
        cli_write(cli, "ERR,vdda,unknown\n");
        return;
    }
    snprintf(buf, sizeof buf, "OK,vdda,mv=%.1f\n", (double)vdda);
    cli_write(cli, buf);
}

static void cmd_start(cli_t *cli, int argc, char **argv)
{
    char   buf[OUT_BUF];
    size_t n;

    (void)argc;
    (void)argv;

    if (!session_start(&s_session)) {
        cli_write(cli, "ERR,start,bad_state\n");
        return;
    }

    sampler_init(&s_sampler, MAX_GAP_US);
    metrics_init(&s_metrics);
    s_next_sample_us = platform_time_us();
    s_worst_us       = 0u;
    s_streaming      = true;

    n = telemetry_encode_header(buf, sizeof buf, SAMPLE_RATE_HZ);
    if (n > 0u) {
        platform_uart_write(buf, n);
    }
}

static void emit_summary(void)
{
    char                buf[OUT_BUF];
    session_metrics_t   result;
    telemetry_summary_t summary = {0};
    size_t              n;

    metrics_result(&s_metrics, &result);

    summary.consumed_mah  = result.consumed_mah;
    summary.consumed_wh   = result.consumed_wh;
    summary.min_voltage_v = result.min_voltage_v;
    summary.max_current_a = result.max_current_a;
    summary.sample_count  = result.sample_count;

    summary.sensor_failures = s_sampler.sensor_failures;
    summary.rejected_time   = s_sampler.rejected_time;
    summary.rejected_value  = s_sampler.rejected_value;
    summary.gaps            = s_sampler.gaps;

    /* Always zero on this build, and honestly so: a superloop that encodes
       and transmits in the same breath has nowhere to drop a sample. The
       ESP32 build has a queue between the two and can. */
    summary.dropped = 0u;

    n = telemetry_encode_summary(buf, sizeof buf, &summary);
    if (n > 0u) {
        platform_uart_write(buf, n);
    }
}

static void cmd_stop(cli_t *cli, int argc, char **argv)
{
    (void)argc;
    (void)argv;

    if (!session_stop(&s_session)) {
        cli_write(cli, "ERR,stop,bad_state\n");
        return;
    }
    s_streaming = false;
    emit_summary();
}

static void cmd_simulate(cli_t *cli, int argc, char **argv)
{
    char          buf[OUT_BUF];
    sim_profile_t profile;

    if (argc < 2) {
        snprintf(buf, sizeof buf, "OK,simulate,enabled=%d,profile=%s\n",
                 platform_stm32_simulation_enabled() ? 1 : 0,
                 simulator_profile_name(platform_stm32_simulation_profile()));
        cli_write(cli, buf);
        return;
    }

    if (session_is_active(&s_session)) {
        /* Changing the source mid-session would put two different
           measurements under one header. */
        cli_write(cli, "ERR,simulate,session_active\n");
        return;
    }

    if (strcmp(argv[1], "off") == 0) {
        platform_stm32_set_simulation(false, SIM_PROFILE_NORMAL);
        cli_write(cli, "OK,simulate,enabled=0\n");
        return;
    }

    if (!simulator_profile_from_name(argv[1], &profile)) {
        cli_write(cli, "ERR,simulate,unknown_profile\n");
        return;
    }

    platform_stm32_set_simulation(true, profile);
    snprintf(buf, sizeof buf, "OK,simulate,enabled=1,profile=%s\n",
             simulator_profile_name(profile));
    cli_write(cli, buf);
}

