misha-z1nchuk/dronebench-ate/firmware/app/stm32/src/app_stm32.c
static void cmd_adc(cli_t *cli, int argc, char **argv)
{
    char  buf[OUT_BUF];
    long  requested = 1;
    long  i;
    float mv;
    float sum  = 0.0f;
    float lo   = 0.0f;
    float hi   = 0.0f;
    long  ok   = 0;
    long  fail = 0;

    if (argc >= 2) {
        requested = strtol(argv[1], NULL, 10);
        if (requested < 1 || requested > ADC_MAX_READS) {
            cli_write(cli, "ERR,adc,bad_count\n");
            return;
        }
    }

    for (i = 0; i < requested; i++) {
        if (!platform_adc_read_millivolts(&mv)) {
            fail++;
            continue;
        }
        if (ok == 0 || mv < lo) lo = mv;
        if (ok == 0 || mv > hi) hi = mv;
        sum += mv;
        ok++;
    }

    /* Refused rather than reported as zero. A calibration point taken from a
       failed read is worse than a missing one. */
    if (ok == 0) {
        cli_write(cli, "ERR,adc,no_reading\n");
        return;
    }

    if (requested == 1) {
        snprintf(buf, sizeof buf, "OK,adc,mv=%.1f\n", (double)sum);
    } else {
        snprintf(buf, sizeof buf,
                 "OK,adc,n=%ld,mv=%.2f,min=%.1f,max=%.1f,pp=%.1f,failed=%ld\n",
                 ok, (double)(sum / (float)ok), (double)lo, (double)hi,
                 (double)(hi - lo), fail);
    }
    cli_write(cli, buf);
}

/* ------------------------------------------------------------------------ */
/* Days 12 and 13: calibration on the bench                                 */
/*                                                                          */
/* These read the hardware whatever `simulate` says. Calibrating against the */
/* simulator would be calibrating nothing.                                  */
/* ------------------------------------------------------------------------ */

/* An optional count argument, 1..ADC_MAX_READS. False on anything else. */
static bool parse_count(int argc, char **argv, int index, long fallback,
                        long *count)
{
    char *end;
    long  value;

    if (argc <= index) {
        *count = fallback;
        return true;
    }
    value = strtol(argv[index], &end, 10);
    if (*end != '\0' || value < 1 || value > ADC_MAX_READS) {
        return false;
    }
    *count = value;
    return true;
}

/* Running mean and spread of a burst of readings. */
typedef struct {
    float sum;
    float lo;
    float hi;
    long  n;
} spread_t;

static void spread_add(spread_t *s, float x)
{
    if (s->n == 0 || x < s->lo) s->lo = x;
    if (s->n == 0 || x > s->hi) s->hi = x;
    s->sum += x;
    s->n++;
}

static float spread_mean(const spread_t *s) { return s->sum / (float)s->n; }

/*
 * The wiring check. What the multimeter should agree with, node by node,
 * before anything is calibrated: A is the battery divider, B and C are the
 * ACS724's OUT and VCC. Day 11 on the ESP32 read B = 1.20 V and C = 1.58 V
 * with the sensor at 4.80 V; the same wires on this board should say the same.
 */
static void cmd_nodes(cli_t *cli, int argc, char **argv)
{
    char                    buf[OUT_BUF];
    float                   a_mv;
    float                   out_mv;
    float                   vcc_mv;
    float                   vcc_v = 0.0f;
    float                   ratio = 0.0f;
    const current_sensor_t *sensor = platform_stm32_current_sensor();
    bool                    ratio_ok;

    (void)argc;
    (void)argv;

    if (!platform_adc_read_millivolts(&a_mv) ||
        !platform_stm32_read_current_nodes(&out_mv, &vcc_mv)) {
        cli_write(cli, "ERR,nodes,no_reading\n");
        return;
    }

    (void)current_sensor_vcc_v(sensor, vcc_mv, &vcc_v);
    ratio_ok = current_sensor_ratio(sensor, out_mv, vcc_mv, &ratio);

    /* ratio=none rather than a number when the sensor's own checks refuse
       it: VCC off or out of range, or OUT at the clip. */
    if (ratio_ok) {
        snprintf(buf, sizeof buf,
                 "OK,nodes,a_mv=%.1f,b_mv=%.1f,c_mv=%.1f,vcc_v=%.3f,ratio=%.5f,"
                 "vdda_mv=%.1f\n",
                 (double)a_mv, (double)out_mv, (double)vcc_mv, (double)vcc_v,
                 (double)ratio, (double)platform_stm32_vdda_mv());
    } else {
        snprintf(buf, sizeof buf,
                 "OK,nodes,a_mv=%.1f,b_mv=%.1f,c_mv=%.1f,vcc_v=%.3f,ratio=none,"
                 "vdda_mv=%.1f\n",
                 (double)a_mv, (double)out_mv, (double)vcc_mv, (double)vcc_v,
                 (double)platform_stm32_vdda_mv());
    }
    cli_write(cli, buf);
}

static void print_calibration(cli_t *cli, const char *verb,
                              const calibration_t *cal)
{
    char buf[OUT_BUF];

    snprintf(buf, sizeof buf,
             "OK,cal,%s,valid=%d,scale_v_per_mv=%.8f,offset_v=%.5f,"
             "rms_mv=%.2f,max_mv=%.2f,points=%" PRIu32 ",pending=%" PRIu32 "\n",
             verb, cal->valid ? 1 : 0, (double)cal->scale_v_per_mv,
             (double)cal->offset_v, (double)(cal->rms_residual_v * 1000.0f),
             (double)(cal->max_residual_v * 1000.0f), cal->points, s_cal_count);
    cli_write(cli, buf);
}

/* Readings averaged per calibration point: 64 reads of 32 conversions each,
   about 25 ms, so the point is taken while the operator is still looking at
   the same number on the meter. */
#define CAL_POINT_READS 64

static void cal_add(cli_t *cli, const char *arg)
{
    char     buf[OUT_BUF];
    char    *end;
    float    ref_v = strtof(arg, &end);
    spread_t s     = {0};
    long     i;

    /* A typo is the likeliest way to ruin a fit, and the least likely to be
       noticed afterwards, so the value is checked as hard as it can be. The
       window is the battery's plausible range with margin either side. */
    if (*end != '\0' || !(ref_v >= 0.5f && ref_v <= 6.0f)) {
        cli_write(cli, "ERR,cal,bad_reference\n");
        return;
    }
    if (s_cal_count >= CALIBRATION_MAX_POINTS) {
        cli_write(cli, "ERR,cal,full\n");
        return;
    }

    for (i = 0; i < CAL_POINT_READS; i++) {
        float mv;

        /* All or nothing: a point averaged over the reads that happened to
           succeed is not the point the operator was looking at. */
        if (!platform_adc_read_millivolts(&mv)) {
            cli_write(cli, "ERR,cal,no_reading\n");
            return;
        }
        spread_add(&s, mv);
    }

    s_cal_points[s_cal_count].measured_mv = spread_mean(&s);
    s_cal_points[s_cal_count].reference_v = ref_v;
    s_cal_count++;

    /* pp is the thing to watch: a point where the node moved while it was
       being read is a point where the meter and the ADC saw different
       voltages. A few tenths of a millivolt is noise; more is a loose wire. */
    snprintf(buf, sizeof buf,
             "OK,cal,add,i=%" PRIu32 ",ref_v=%.4f,mv=%.2f,pp=%.2f\n",
             s_cal_count, (double)ref_v, (double)spread_mean(&s),
             (double)(s.hi - s.lo));
    cli_write(cli, buf);
}

static void cal_fit(cli_t *cli)
{
    char          buf[OUT_BUF];
    calibration_t cal;
    uint32_t      i;

    calibration_init(&cal);
    if (!calibration_fit(&cal, s_cal_points, s_cal_count)) {
        /* Fewer than three points, two identical readings, or a negative
           slope — calibration.h lists the refusals. */
        cli_write(cli, "ERR,cal,fit_refused\n");
        return;
    }
    platform_stm32_set_voltage_calibration(&cal);

