misha-z1nchuk/dronebench-ate/firmware/app/stm32/src/app_stm32.c
    /* Per-point residuals: the table for PROGRESS.md, and the only way to see
       whether the miss is spread evenly (noise) or grows toward one end
       (non-linearity, the plan's risk 3). */
    for (i = 0; i < s_cal_count; i++) {
        float fit_v = 0.0f;

        (void)calibration_apply(&cal, s_cal_points[i].measured_mv, &fit_v);
        snprintf(buf, sizeof buf,
                 "OK,cal,point,i=%" PRIu32 ",ref_v=%.4f,mv=%.2f,fit_v=%.4f,"
                 "res_mv=%+.2f\n",
                 i + 1u, (double)s_cal_points[i].reference_v,
                 (double)s_cal_points[i].measured_mv, (double)fit_v,
                 (double)((s_cal_points[i].reference_v - fit_v) * 1000.0f));
        cli_write(cli, buf);
    }

    print_calibration(cli, "fit", &cal);

    /* Ready to paste into bench_calibration.h, so the numbers that go into
       the commit are the ones the board printed, not ones retyped. */
    snprintf(buf, sizeof buf,
             "#define BENCH_VOLTAGE_SCALE_V_PER_MV %.8ff\n"
             "#define BENCH_VOLTAGE_OFFSET_V       %.6ff\n",
             (double)cal.scale_v_per_mv, (double)cal.offset_v);
    cli_write(cli, buf);
    snprintf(buf, sizeof buf,
             "#define BENCH_VOLTAGE_RMS_RESIDUAL_V %.6ff\n"
             "#define BENCH_VOLTAGE_MAX_RESIDUAL_V %.6ff\n"
             "#define BENCH_VOLTAGE_POINTS         %" PRIu32 "u\n",
             (double)cal.rms_residual_v, (double)cal.max_residual_v, cal.points);
    cli_write(cli, buf);
}

/*
 * Day 12, end to end:
 *
 *   cal add 4.203    multimeter reads 4.203 V at the divider input; the board
 *                    pairs it with its own reading of the node, now
 *   cal undo         drop the last point (a typo, a wire that moved)
 *   cal fit          least squares over the points, applied immediately,
 *                    residual per point, and the lines for the header
 *   cal clear        drop the pending points
 *   cal              the calibration in use
 */
static void cmd_cal(cli_t *cli, int argc, char **argv)
{
    if (argc < 2 || strcmp(argv[1], "show") == 0) {
        print_calibration(cli, "show", platform_stm32_voltage_calibration());
        return;
    }
    if (strcmp(argv[1], "add") == 0 && argc == 3) {
        cal_add(cli, argv[2]);
        return;
    }
    if (strcmp(argv[1], "undo") == 0) {
        if (s_cal_count > 0u) {
            s_cal_count--;
        }
        print_calibration(cli, "undo", platform_stm32_voltage_calibration());
        return;
    }
    if (strcmp(argv[1], "clear") == 0) {
        s_cal_count = 0u;
        print_calibration(cli, "clear", platform_stm32_voltage_calibration());
        return;
    }
    if (strcmp(argv[1], "fit") == 0) {
        cal_fit(cli);
        return;
    }
    cli_write(cli, "ERR,cal,usage: cal [show|add <volts>|undo|clear|fit]\n");
}

/* Calibrated battery volts, one-shot. What the stream would say, without a
   session: the check against the multimeter after `cal fit`. */
static void cmd_volts(cli_t *cli, int argc, char **argv)
{
    char                 buf[OUT_BUF];
    const calibration_t *cal = platform_stm32_voltage_calibration();
    spread_t             s   = {0};
    long                 count;
    long                 i;

    if (!parse_count(argc, argv, 1, 16, &count)) {
        cli_write(cli, "ERR,volts,bad_count\n");
        return;
    }
    if (!cal->valid) {
        cli_write(cli, "ERR,volts,not_calibrated\n");
        return;
    }

    for (i = 0; i < count; i++) {
        float mv;
        float v;

        if (platform_adc_read_millivolts(&mv) && calibration_apply(cal, mv, &v)) {
            spread_add(&s, v);
        }
    }
    if (s.n == 0) {
        cli_write(cli, "ERR,volts,no_reading\n");
        return;
    }

    snprintf(buf, sizeof buf, "OK,volts,v=%.4f,n=%ld,pp_mv=%.2f,failed=%ld\n",
             (double)spread_mean(&s), s.n, (double)((s.hi - s.lo) * 1000.0f),
             count - s.n);
    cli_write(cli, buf);
}

/* Reads averaged for a zero: about 0.3 ms each, so 512 is ~150 ms. */
#define ZERO_READS 512

/*
 * Day 13: the ratio OUT / VCC with no current through the sensor, stored as
 * the zero. Taken as a ratio rather than volts so it keeps holding when USB
 * moves — current_sensor.h has the argument.
 *
 * Nothing on the power terminals when this runs. The sensor cannot tell a
 * zero from a steady current, and current_sensor_set_zero() only catches a
 * large one.
 */
static void cmd_zero(cli_t *cli, int argc, char **argv)
{
    char              buf[OUT_BUF];
    current_sensor_t *sensor = platform_stm32_current_sensor();
    spread_t          s      = {0};
    float             vcc_sum = 0.0f;
    long              i;

    (void)argc;
    (void)argv;

    for (i = 0; i < ZERO_READS; i++) {
        float out_mv;
        float vcc_mv;
        float ratio;
        float vcc_v;

        if (!platform_stm32_read_current_nodes(&out_mv, &vcc_mv) ||
            !current_sensor_ratio(sensor, out_mv, vcc_mv, &ratio) ||
            !current_sensor_vcc_v(sensor, vcc_mv, &vcc_v)) {
            /* Refused whole, same reason as a calibration point. The most
               likely cause is the VCC wire, and `nodes` will show it. */
            cli_write(cli, "ERR,zero,no_reading\n");
            return;
        }
        spread_add(&s, ratio);
        vcc_sum += vcc_v;
    }

    if (!current_sensor_set_zero(sensor, spread_mean(&s))) {
        /* Further from 0.5 than any healthy offset: current is flowing, or
           OUT and VCC are on each other's pins. */
        snprintf(buf, sizeof buf, "ERR,zero,implausible,ratio=%.5f\n",
                 (double)spread_mean(&s));
        cli_write(cli, buf);
        return;
    }

    /* The spread in amps is the noise of a single read, which is what the
       stream will carry — worth seeing next to the zero it was averaged into. */
    snprintf(buf, sizeof buf,
             "OK,zero,ratio=%.5f,offset_a=%+.3f,pp_a=%.3f,vcc_v=%.3f,n=%ld\n"
             "#define BENCH_CURRENT_ZERO_RATIO %.5ff\n",
             (double)spread_mean(&s),
             (double)((spread_mean(&s) - 0.5f) * sensor->amps_per_ratio),
             (double)((s.hi - s.lo) * sensor->amps_per_ratio),
             (double)(vcc_sum / (float)s.n), s.n, (double)spread_mean(&s));
    cli_write(cli, buf);
}

