misha-z1nchuk/dronebench-ate/firmware/app/stm32/src/app_stm32.c
/* Current, one-shot, with VCC beside it so a drifting supply is visible. */
static void cmd_amps(cli_t *cli, int argc, char **argv)
{
    char                    buf[OUT_BUF];
    const current_sensor_t *sensor = platform_stm32_current_sensor();
    spread_t                s      = {0};
    float                   vcc_v  = 0.0f;
    long                    count;
    long                    i;

    if (!parse_count(argc, argv, 1, 64, &count)) {
        cli_write(cli, "ERR,amps,bad_count\n");
        return;
    }
    if (!sensor->zeroed) {
        cli_write(cli, "ERR,amps,not_zeroed\n");
        return;
    }

    for (i = 0; i < count; i++) {
        float out_mv;
        float vcc_mv;
        float a;

        if (platform_stm32_read_current_nodes(&out_mv, &vcc_mv) &&
            current_sensor_amps(sensor, out_mv, vcc_mv, &a)) {
            spread_add(&s, a);
            (void)current_sensor_vcc_v(sensor, vcc_mv, &vcc_v);
        }
    }
    if (s.n == 0) {
        cli_write(cli, "ERR,amps,no_reading\n");
        return;
    }

    snprintf(buf, sizeof buf,
             "OK,amps,a=%+.3f,n=%ld,pp_a=%.3f,vcc_v=%.3f,failed=%ld\n",
             (double)spread_mean(&s), s.n, (double)(s.hi - s.lo),
             (double)vcc_v, count - s.n);
    cli_write(cli, buf);
}

static const cli_command_t COMMANDS[] = {
    {"help", "list available commands", cmd_help},
    {"version", "firmware version and build date", cmd_version},
    {"status", "current bench state", cmd_status},
    {"start", "begin a measurement session", cmd_start},
    {"stop", "end the current session", cmd_stop},
    {"simulate", "select a simulated profile, or off", cmd_simulate},
    {"adc", "raw millivolts at the ADC pin, for calibration", cmd_adc},
    {"vdda", "the supply the ADC measures against, from VREFINT", cmd_vdda},
    {"nodes", "millivolts at all three divider nodes, for wiring", cmd_nodes},
    {"cal", "day 12: cal add <volts> | undo | clear | fit | show", cmd_cal},
    {"volts", "calibrated battery volts [reads]", cmd_volts},
    {"zero", "day 13: store the no-current ratio of the ACS724", cmd_zero},
    {"amps", "calibrated current [reads]", cmd_amps},
};

/* ------------------------------------------------------------------------ */
/* Entry points                                                             */
/* ------------------------------------------------------------------------ */

void app_stm32_init(void)
{
    platform_stm32_init();

    cli_init(&s_cli, COMMANDS, sizeof COMMANDS / sizeof COMMANDS[0], cli_out,
             NULL);
    session_init(&s_session);
    sampler_init(&s_sampler, MAX_GAP_US);
    metrics_init(&s_metrics);
    platform_stm32_set_simulation(true, SIM_PROFILE_NORMAL);

    print_banner();
    out("type 'help' for commands\n");
}

void app_stm32_poll(void)
{
    console_poll();
    platform_watchdog_feed();

    if (!s_streaming) {
        return;
    }

    {
        uint64_t now = platform_time_us();

        /* Unsigned comparison, so this is written as a difference against the
           deadline rather than "now > due" — but both operands are absolute
           and monotonic, and platform_time_us() guarantees the second part.
           A clock that went backwards here would stall the stream forever
           rather than produce a wrong number, which is the better of the two
           failures and the reason the guarantee is in the interface. */
        if (now < s_next_sample_us) {
            return;
        }

        {
            power_sample_t sample;
            uint64_t       took_us;

            if (sampler_take(&s_sampler, &sample) == SAMPLE_OK) {
                char   buf[OUT_BUF];
                size_t n;

                metrics_add(&s_metrics, &sample);
                n = telemetry_encode_sample(buf, sizeof buf, &sample);
                if (n > 0u) {
                    platform_uart_write(buf, n);
                }
            }

            /* From the deadline check, so it includes all four ADC channels,
               the encode and the blocking transmit — everything the period
               has to fit. */
            took_us = platform_time_us() - now;
            if (took_us > s_worst_us) {
                s_worst_us = (took_us > UINT32_MAX) ? UINT32_MAX : (uint32_t)took_us;
            }
        }

        s_next_sample_us += SAMPLE_PERIOD_US;

        /* If the loop fell so far behind that catching up would mean a burst
           of back-to-back samples, give up the lost periods instead. A burst
           would arrive with timestamps that say 2 ms apart while really being
           microseconds apart, and the host has no way to tell. */
        if (s_next_sample_us < now) {
            s_next_sample_us = now + SAMPLE_PERIOD_US;
        }
    }
}
